Revit 2027 API
ParameterFilterRuleFactory.CreateGreaterOrEqualRule Method
Overload List
Name | Description
CreateGreaterOrEqualRule(ElementId, ElementId) |  Creates a filter rule that determines whether ElementId values from the document are greater than or equal to a certain value.
CreateGreaterOrEqualRule(ElementId, Int32) |  Creates a filter rule that determines whether integer values from the document are greater than or equal to a certain value.
CreateGreaterOrEqualRule(ElementId, String) |  Creates a filter rule that determines whether strings from the document are greater than or equal to a certain value.
CreateGreaterOrEqualRule(ElementId, Double, Double) |  Creates a filter rule that determines whether double-precision values from the document are greater than or equal to a certain value.
Top
See Also
Reference
ParameterFilterRuleFactory Class
Autodesk.Revit.DB Namespace